app/Http/Controllers/MyPageController.php

    public function index()
    {
        $user = Auth::user();
        $all_users = User::where('id', '!=', $user->id)->paginate(10);
        $latestPost = Post::latest()->first();
---
select count(*) as aggregate from `users` where `id` != 1
select * from `posts` where `posts`.`deleted_at` is null order by `created_at` desc limit 1