app/Http/Controllers/PostController.php

    public function index()
    {
        $posts = Post::with('user')->get();
---
select * from `posts` where `posts`.`deleted_at` is null
select * from `users` where `users`.`id` in (1)

    public function create(Category $category)
    {
        $categories = Category::all();
---
select * from `categories`